rails/app/controllers/diaries_controller.rb

SELECT  `diaries`.* FROM `diaries`   ORDER BY id DESC LIMIT 20
---
  def index
    @diaries = Diary.order('id DESC').limit(20)

INSERT INTO `diaries` (`created_at`, `name`, `text`, `title`, `updated_at`) VALUES ('2015-05-13 08:37:32', 'ただち', '楽しかったですね', '今日は合宿最終日でした', '2015-05-13 08:37:32')
---
  def create
    @diary = Diary.new(diary_params)

    respond_to do |format|
      if @diary.save

SELECT  `diaries`.* FROM `diaries`  WHERE `diaries`.`id` = 1 LIMIT 1
---
    def set_diary
      @diary = Diary.find(params[:id])